atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2018 Davide Bettio <davide@uninstall.it>
 * Copyright 2020-2022 Fred Dushin <fred@dushin.net>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include <atom.h>
#include <context.h>
#include <debug.h>
#include <globalcontext.h>
#include <interop.h>
#include <mailbox.h>
#include <platform_defaultatoms.h>
#include <port.h>
#include <sdkconfig.h>
#include <term.h>
#include <utils.h>

// #define ENABLE_TRACE 1
#include <trace.h>

#include <esp32_sys.h>
#include <esp_log.h>
#include <esp_wifi.h>
#include <lwip/inet.h>

#include <string.h>

#if ESP_IDF_VERSION_MAJOR < 4
#include <apps/sntp/sntp.h>
#else
#include <lwip/apps/sntp.h>
#endif

#if ESP_IDF_VERSION_MAJOR >= 4
#define TCPIP_HOSTNAME_MAX_SIZE 255
#endif

#define TAG "network_driver"
#define PORT_REPLY_SIZE TUPLE_SIZE(2) + REF_SIZE

static const char *const ap_atom = ATOM_STR("\x2", "ap");
static const char *const ap_sta_connected_atom = ATOM_STR("\x10", "ap_sta_connected");
static const char *const ap_sta_disconnected_atom = ATOM_STR("\x13", "ap_sta_disconnected");
static const char *const ap_sta_ip_assigned_atom = ATOM_STR("\x12", "ap_sta_ip_assigned");
static const char *const ap_started_atom = ATOM_STR("\xA", "ap_started");
static const char *const dhcp_hostname_atom = ATOM_STR("\xD", "dhcp_hostname");
static const char *const host_atom = ATOM_STR("\x4", "host");
static const char *const max_connections_atom = ATOM_STR("\xF", "max_connections");
static const char *const psk_atom = ATOM_STR("\x3", "psk");
static const char *const sntp_atom = ATOM_STR("\x4", "sntp");
static const char *const ssid_atom = ATOM_STR("\x4", "ssid");
static const char *const ssid_hidden_atom = ATOM_STR("\xB", "ssid_hidden");
static const char *const sta_atom = ATOM_STR("\x3", "sta");
static const char *const sta_connected_atom = ATOM_STR("\xD", "sta_connected");
static const char *const sta_disconnected_atom = ATOM_STR("\x10", "sta_disconnected");
static const char *const sta_got_ip_atom = ATOM_STR("\xA", "sta_got_ip");

enum network_cmd
{
    NetworkInvalidCmd = 0,
    // TODO add support for scan, ifconfig
    NetworkStartCmd
};

static const AtomStringIntPair cmd_table[] = {
    { ATOM_STR("\x5", "start"), NetworkStartCmd },
    SELECT_INT_DEFAULT(NetworkInvalidCmd)
};

struct ClientData
{
    GlobalContext *global;
    uint32_t port_process_id;
    uint32_t owner_process_id;
    uint64_t ref_ticks;
};

static inline term make_atom(GlobalContext *global, AtomString atom_str)
{
    return globalcontext_make_atom(global, atom_str);
}

static term tuple_from_addr(Context *ctx, uint32_t addr)
{
    term terms[4];
    terms[0] = term_from_int32((addr >> 24) & 0xFF);
    terms[1] = term_from_int32((addr >> 16) & 0xFF);
    terms[2] = term_from_int32((addr >> 8) & 0xFF);
    terms[3] = term_from_int32(addr & 0xFF);

    return port_create_tuple_n(ctx, 4, terms);
}

// WARNING: this function assumes space has been allocated for the reference
// and that the context has been safely acquired under a lock
static void send_term(Context *ctx, struct ClientData *data, term t)
{
    term ref = term_from_ref_ticks(data->ref_ticks, ctx);
    term msg = term_alloc_tuple(2, ctx);
    term_put_tuple_element(msg, 0, ref);
    term_put_tuple_element(msg, 1, t);

    // Pid ! {Ref, T}
    port_send_message_nolock(ctx->global, term_from_local_process_id(data->owner_process_id), msg);
}

static void send_got_ip(struct ClientData *data, tcpip_adapter_ip_info_t *info)
{
    TRACE("Sending got_ip back to AtomVM\n");

    Context *ctx = globalcontext_get_process_lock(data->global, data->port_process_id);
    {
        // {Ref, {sta_got_ip, {{192, 168, 1, 2}, {255, 255, 255, 0}, {192, 168, 1, 1}}}}
        size_t heap_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(3) + TUPLE_SIZE(4) * 3;
        if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
            ESP_LOGE(TAG, "Unable to allocate heap space for sta_got_ip; no reply sent");
        } else {
            term ip = tuple_from_addr(ctx, ntohl(info->ip.addr));
            term netmask = tuple_from_addr(ctx, ntohl(info->netmask.addr));
            term gw = tuple_from_addr(ctx, ntohl(info->gw.addr));

            term ip_info = port_create_tuple3(ctx, ip, netmask, gw);
            term reply = port_create_tuple2(ctx, make_atom(ctx->global, sta_got_ip_atom), ip_info);
            send_term(ctx, data, reply);
        }
    }
    globalcontext_get_process_unlock(data->global, ctx);
}

static void send_sta_connected(struct ClientData *data)
{
    TRACE("Sending sta_connected back to AtomVM\n");

    Context *ctx = globalcontext_get_process_lock(data->global, data->port_process_id);
    {
        // {Ref, sta_connected}
        size_t heap_size = PORT_REPLY_SIZE;
        if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
            ESP_LOGE(TAG, "Unable to allocate heap space for sta_connected; no message sent");
        } else {
            send_term(ctx, data, make_atom(ctx->global, sta_connected_atom));
        }
    }
    globalcontext_get_process_unlock(data->global, ctx);
}

static void send_sta_disconnected(struct ClientData *data)
{
    TRACE("Sending sta_disconnected back to AtomVM\n");

    Context *ctx = globalcontext_get_process_lock(data->global, data->port_process_id);
    {
        // {Ref, sta_disconnected}
        size_t heap_size = PORT_REPLY_SIZE;
        if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
            ESP_LOGE(TAG, "Unable to allocate heap space for sta_disconnected; no message sent");
        } else {
            send_term(ctx, data, make_atom(ctx->global, sta_disconnected_atom));
        }
    }
    globalcontext_get_process_unlock(data->global, ctx);
}

static void send_ap_started(struct ClientData *data)
{
    TRACE("Sending ap_start back to AtomVM\n");

    Context *ctx = globalcontext_get_process_lock(data->global, data->port_process_id);
    {
        // {Ref, ap_started}
        size_t heap_size = PORT_REPLY_SIZE;
        if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
            ESP_LOGE(TAG, "Unable to allocate heap space for ap_started; no message sent");
        } else {
            send_term(ctx, data, make_atom(ctx->global, ap_started_atom));
        }
    }
    globalcontext_get_process_unlock(data->global, ctx);
}

static void send_atom_mac(Context *ctx, struct ClientData *data, term atom, uint8_t *mac)
{
    // {Ref, {ap_connected | ap_disconnected, <<1,2,3,4,5,6>>}}
    size_t heap_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + term_binary_heap_size(6);
    if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
        ESP_LOGE(TAG, "Unable to allocate heap space for ap_connected or ap_disconnected; no message sent");
    } else {
        term mac_term = term_from_literal_binary(mac, 6, ctx);
        term reply = port_create_tuple2(ctx, atom, mac_term);
        send_term(ctx, data, reply);
    }
}

