atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
static void send_ap_sta_connected(struct ClientData *data, uint8_t *mac)
{
    TRACE("Sending ap_sta_connected back to AtomVM\n");

    Context *ctx = globalcontext_get_process_lock(data->global, data->port_process_id);
    {
        send_atom_mac(ctx, data, make_atom(ctx->global, ap_sta_connected_atom), mac);
    }
    globalcontext_get_process_unlock(data->global, ctx);
}

static void send_ap_sta_disconnected(struct ClientData *data, uint8_t *mac)
{
    TRACE("Sending ap_sta_disconnected back to AtomVM\n");

    Context *ctx = globalcontext_get_process_lock(data->global, data->port_process_id);
    {
        send_atom_mac(ctx, data, make_atom(ctx->global, ap_sta_disconnected_atom), mac);
    }
    globalcontext_get_process_unlock(data->global, ctx);
}

static void send_ap_sta_ip_assigned(struct ClientData *data, esp_ip4_addr_t *ip)
{
    TRACE("Sending ap_sta_ip_assigned back to AtomVM\n");

    Context *ctx = globalcontext_get_process_lock(data->global, data->port_process_id);
    {
        // {Ref, {ap_sta_ip_assigned, {192, 168, 4, 2}}}
        size_t heap_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(4);
        if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
            ESP_LOGE(TAG, "Unable to allocate heap space for ap_sta_ip_assigned; no message sent");
        } else {
            term ip_term = tuple_from_addr(ctx, ntohl(ip->addr));
            term reply = port_create_tuple2(ctx, make_atom(ctx->global, ap_sta_ip_assigned_atom), ip_term);
            send_term(ctx, data, reply);
        }
    }
    globalcontext_get_process_unlock(data->global, ctx);
}

#define UNLIKELY_NOT_ESP_OK(E) UNLIKELY((E) != ESP_OK)

//
// Event Handler
//

static void event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    struct ClientData *data = (struct ClientData *) arg;

    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {

        ESP_LOGI(TAG, "WIFI_EVENT_STA_START received.");
        esp_wifi_connect();

    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_CONNECTED) {

        ESP_LOGI(TAG, "WIFI_EVENT_STA_CONNECTED received.");
        send_sta_connected(data);

    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {

        ip_event_got_ip_t *event = (ip_event_got_ip_t *) event_data;
        ESP_LOGI(TAG, "IP_EVENT_STA_GOT_IP: %s", inet_ntoa(event->ip_info.ip));
        send_got_ip(data, (tcpip_adapter_ip_info_t *) &event->ip_info.ip);

    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {

        ESP_LOGI(TAG, "WIFI_EVENT_STA_DISCONNECTED received.");
        esp_wifi_connect();
        send_sta_disconnected(data);

    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_START) {

        ESP_LOGI(TAG, "WIFI_EVENT_AP_START received.");
        send_ap_started(data);

    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_STACONNECTED) {

        ESP_LOGI(TAG, "WIFI_EVENT_AP_STACONNECTED received.");
        wifi_event_ap_staconnected_t *event = (wifi_event_ap_staconnected_t *) event_base;
        send_ap_sta_connected(data, event->mac);

    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_STADISCONNECTED) {

        ESP_LOGI(TAG, "WIFI_EVENT_AP_STADISCONNECTED received.");
        wifi_event_ap_stadisconnected_t *event = (wifi_event_ap_stadisconnected_t *) event_base;
        send_ap_sta_disconnected(data, event->mac);

    } else if (event_base == IP_EVENT && event_id == IP_EVENT_AP_STAIPASSIGNED) {

        ip_event_ap_staipassigned_t *event = (ip_event_ap_staipassigned_t *) event_data;
        ESP_LOGI(TAG, "IP_EVENT_AP_STAIPASSIGNED: %s", inet_ntoa(event->ip));
        send_ap_sta_ip_assigned(data, (esp_ip4_addr_t *) &event->ip);

    } else {
        ESP_LOGI(TAG, "Unhandled wifi event: %i.", event_id);
    }
}

//
// message processing
//

static wifi_config_t *get_sta_wifi_config(term sta_config, GlobalContext *global)
{
    if (term_is_invalid_term(sta_config)) {
        TRACE("No STA config\n");
        return NULL;
    }
    term ssid_term = interop_kv_get_value(sta_config, ssid_atom, global);
    term pass_term = interop_kv_get_value(sta_config, psk_atom, global);

    //
    // Check parameters
    //
    if (term_is_invalid_term(ssid_term)) {
        ESP_LOGE(TAG, "get_sta_wifi_config: Missing SSID");
        return NULL;
    }
    int ok = 0;
    char *ssid = interop_term_to_string(ssid_term, &ok);
    if (!ok || IS_NULL_PTR(ssid)) {
        ESP_LOGE(TAG, "get_sta_wifi_config: Invalid SSID");
        return NULL;
    }
    char *psk = NULL;
    if (term_is_invalid_term(pass_term)) {
        ESP_LOGW(TAG, "Warning: Attempting to connect to open network");
    } else {
        psk = interop_term_to_string(pass_term, &ok);
        if (!ok) {
            free(ssid);
            ESP_LOGE(TAG, "get_sta_wifi_config: Invalid PSK");
            return NULL;
        }
    }

    //
    // Allocate wifi_config and check variable sizes
    //
    wifi_config_t *wifi_config = malloc(sizeof(wifi_config_t));
    if (IS_NULL_PTR(wifi_config)) {
        ESP_LOGE(TAG, "Failed to allocate wifi_config_t for sta");
        return NULL;
    }
    if (UNLIKELY(strlen(ssid) > sizeof(wifi_config->sta.ssid))) {
        ESP_LOGE(TAG, "ssid cannot be more than %d characters", sizeof(wifi_config->sta.ssid));
        free(ssid);
        free(psk);
        return NULL;
    }
    if (UNLIKELY(strlen(psk) > sizeof(wifi_config->sta.password))) {
        ESP_LOGE(TAG, "psk cannot be more than %d characters", sizeof(wifi_config->sta.password));
        free(ssid);
        free(psk);
        return NULL;
    }

    //
    // Initialize the wifi_config structure
    //
    memset(wifi_config, 0, sizeof(wifi_config_t));
    strcpy((char *) wifi_config->sta.ssid, ssid);
    if (!IS_NULL_PTR(psk)) {
        strcpy((char *) wifi_config->sta.password, psk);
        free(psk);
    }
    free(ssid);

    //
    // done
    //
    ESP_LOGI(TAG, "STA ssid: %s", wifi_config->sta.ssid);
    return wifi_config;
}

